* Conditional Subqueries: NOT IN
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database auction
:END:
Write a SQL query that shows all items that have not had bids put on them. Use the logical operator NOT IN for this exercise, as well as a subquery.

Here is the expected output:

Copy Code
 Not Bid On
------------
 Television
(1 row)

#+BEGIN_SRC sql
  SELECT name AS "Not Bid ON"
    FROM items
   WHERE items.id NOT IN
         (SELECT item_id
            FROM bids);

#+END_SRC

#+RESULTS:
| Not Bid ON |
|------------|
| Television |
